ChipstackLTD/Zerobase/boards.txt
# Optimizations
ZEROBASE_CORE.menu.opt.oslto=Smallest (-Os) with LTO
ZEROBASE_CORE.menu.opt.oslto.build.flags.optimize=-Os -flto
ZEROBASE_CORE.menu.opt.osstd=Smallest (-Os)
ZEROBASE_CORE.menu.opt.osstd.build.flags.optimize=-Os
ZEROBASE_CORE.menu.opt.o1std=Fast (-O1)
ZEROBASE_CORE.menu.opt.o1std.build.flags.optimize=-O1
ZEROBASE_CORE.menu.opt.o1lto=Fast (-O1) with LTO
ZEROBASE_CORE.menu.opt.o1lto.build.flags.optimize=-O1 -flto
ZEROBASE_CORE.menu.opt.o2std=Faster (-O2)
ZEROBASE_CORE.menu.opt.o2std.build.flags.optimize=-O2
ZEROBASE_CORE.menu.opt.o2lto=Faster (-O2) with LTO
ZEROBASE_CORE.menu.opt.o2lto.build.flags.optimize=-O2 -flto
ZEROBASE_CORE.menu.opt.o3std=Fastest (-O3)
ZEROBASE_CORE.menu.opt.o3std.build.flags.optimize=-O3
ZEROBASE_CORE.menu.opt.o3lto=Fastest (-O3) with LTO
ZEROBASE_CORE.menu.opt.o3lto.build.flags.optimize=-O3 -flto
ZEROBASE_CORE.menu.opt.ogstd=Debug (-Og)
ZEROBASE_CORE.menu.opt.ogstd.build.flags.optimize=-Og
ZEROBASE_CORE.menu.opt.o0std=No Optimization (-O0)
ZEROBASE_CORE.menu.opt.o0std.build.flags.optimize=-O0


# Debug information
ZEROBASE_CORE.menu.dbg.none=None
ZEROBASE_CORE.menu.dbg.none.build.flags.debug=-DNDEBUG
ZEROBASE_CORE.menu.dbg.enable_sym=Symbols Enabled (-g)
ZEROBASE_CORE.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
ZEROBASE_CORE.menu.dbg.enable_log=Core logs Enabled
ZEROBASE_CORE.menu.dbg.enable_log.build.flags.debug=
ZEROBASE_CORE.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
ZEROBASE_CORE.menu.dbg.enable_all.build.flags.debug=-g


# C Runtime Library
ZEROBASE_CORE.menu.rtlib.nano=Newlib Nano (default)
ZEROBASE_CORE.menu.rtlib.nano.build.flags.ldflags=--specs=nano.specs --specs=nosys.specs
ZEROBASE_CORE.menu.rtlib.nanofp=Newlib Nano + Float Printf
ZEROBASE_CORE.menu.rtlib.nanofp.build.flags.ldflags=--specs=nano.specs --specs=nosys.specs -u _printf_float
ZEROBASE_CORE.menu.rtlib.nanofs=Newlib Nano + Float Scanf
ZEROBASE_CORE.menu.rtlib.nanofs.build.flags.ldflags=--specs=nano.specs --specs=nosys.specs -u _scanf_float
ZEROBASE_CORE.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
ZEROBASE_CORE.menu.rtlib.nanofps.build.flags.ldflags=--specs=nano.specs --specs=nosys.specs -u _printf_float -u _scanf_float
ZEROBASE_CORE.menu.rtlib.full=Newlib Standard
ZEROBASE_CORE.menu.rtlib.full.build.flags.ldflags=--specs=nosys.specs

# I2C Slave support
ZEROBASE_CORE.menu.i2cslave.disabled=I2C Slave Disabled (saves ~1K flash)
ZEROBASE_CORE.menu.i2cslave.disabled.build.flags.i2cslave=-DOPT_I2C_SLAVE=0
ZEROBASE_CORE.menu.i2cslave.enabled=I2C Slave Enabled
ZEROBASE_CORE.menu.i2cslave.enabled.build.flags.i2cslave=-DOPT_I2C_SLAVE=1